rust/note/rust_note.org
#+TITLE:     rust_note
#+AUTHOR:    rzry https://github.com/rzry
#+EMAIL:     rzry36008@ccie.lol
#+DATE:      2020-10-30
#+LANGUAGE:  en

