rust/note/rust_note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-01 一 13:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rust<sub>note</sub></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rzry https://github.com/rzry" />
<link rel='stylesheet' type='text/css' href='http://zxxky.cn/1.css'>
</head>
<body>
<div id="content">
<h1 class="title">rust<sub>note</sub></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb178f41">1. <span class="todo TODO">TODO</span> 2020.10.30</a></li>
<li><a href="#orgbd9aa1c">2. 2021-02-05</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb178f41" class="outline-2">
<h2 id="orgb178f41"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> 2020.10.30</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><p>
2.0
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"Hello, world!"</span>);
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">let == var</span>
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">mut &#35753;&#21464;&#37327;&#21487;&#21464;</span>
<span style="color: #81A1C1;">let</span> <span style="color: #81A1C1;">mut</span> <span style="color: #D8DEE9;">guess</span> = <span style="color: #8FBCBB;">String</span>::new();

<span style="color: #81A1C1;">io</span>::stdin().read_line(&amp;<span style="color: #81A1C1;">mut</span> guess)
    .expect(<span style="color: #A3BE8C;">"&#35835;&#21462;&#19968;&#34892;"</span>);
<span style="color: #6f7787;">// </span><span style="color: #6f7787;">read_line &#36820;&#22238;&#19968;&#20010; result -&gt; res,err</span>
<span style="color: #6f7787;">// </span><span style="color: #6f7787;">expect &#25509;&#25910;&#36820;&#22238;</span>
<span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">rzry</span> = <span style="color: #A3BE8C;">"rzry"</span>;
<span style="color: #6f7787;">// </span><span style="color: #6f7787;">&#30456;&#24403;&#20110; fmt {} &#25509;&#21463;&#21442;&#25968;</span>

<span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"hello : </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;"> </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,guess,rzry)
</pre>
</div></li>

<li><p>
猜游戏
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #81A1C1;">use</span> <span style="color: #81A1C1;">std</span>::io;
<span style="color: #81A1C1;">use</span> <span style="color: #81A1C1;">std</span>::<span style="color: #81A1C1;">cmp</span>::<span style="color: #8FBCBB;">Ordering</span>;
<span style="color: #81A1C1;">use</span> <span style="color: #81A1C1;">rand</span>::<span style="color: #8FBCBB;">Rng</span>;
<span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">main</span>() {
    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"&#33719;&#21462;&#19968;&#20010;&#25968;"</span>);
    <span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#38543;&#26426;&#25968; &#36171;&#20540;&#32473;number</span>
    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">number</span> = <span style="color: #81A1C1;">rand</span>::thread_rng().gen_range(1, 100);


    <span style="color: #6f7787;">// </span><span style="color: #6f7787;">&#36755;&#20837;&#19968;&#20010;&#25968;</span>
   <span style="color: #81A1C1;">loop</span> {
       <span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#21021;&#22987;&#21270;&#19968;&#20010; scan</span>
    <span style="color: #81A1C1;">let</span> <span style="color: #81A1C1;">mut</span> <span style="color: #D8DEE9;">scan</span> = <span style="color: #8FBCBB;">String</span>::new();
       <span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#33719;&#21462;&#38190;&#30424;&#36755;&#20837; &#28982;&#21518;&#36171;&#20540;&#32473; scan</span>
    <span style="color: #81A1C1;">io</span>::stdin().read_line(&amp;<span style="color: #81A1C1;">mut</span> scan)
        .expect(<span style="color: #A3BE8C;">"get num : "</span>);
       <span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#21021;&#22987;&#21270;&#20026;String::new()</span>
       <span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#26684;&#24335;&#36716;&#25442;&#20026;u32</span>
       <span style="color: #6f7787;">//    </span><span style="color: #6f7787;">let scan:u32 = scan.trim().parse()</span>
       <span style="color: #6f7787;">//      </span><span style="color: #6f7787;">.expect("&#36755;&#20837;&#19968;&#20010;num");</span>
       <span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#22788;&#29702;&#36755;&#20837;&#38750;u32</span>
       <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">scan</span>:<span style="color: #8FBCBB;">u32</span> = <span style="color: #81A1C1;">match</span> scan.trim().parse() {
           <span style="color: #8FBCBB;">Ok</span>(num)=&gt;num,
           <span style="color: #8FBCBB;">Err</span>(_)=&gt; {
               <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"enter num"</span>);
               <span style="color: #81A1C1;">continue</span>;
           },
       };
       <span style="color: #6f7787;">// </span><span style="color: #6f7787;">&#20004;&#20010;&#25968;&#27604;&#36739;</span>
    <span style="color: #81A1C1;">match</span> scan.cmp(&amp;number) {
        <span style="color: #8FBCBB;">Ordering</span>::<span style="color: #8FBCBB;">Less</span> =&gt; <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"&#23567;"</span>),
        <span style="color: #8FBCBB;">Ordering</span>::<span style="color: #8FBCBB;">Greater</span> =&gt; <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"&#22823;"</span>),
        <span style="color: #8FBCBB;">Ordering</span>::<span style="color: #8FBCBB;">Equal</span> =&gt;{
            <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"ok"</span>);
            <span style="color: #81A1C1;">break</span>;
        },
    }
   }

}

</pre>
</div></li>

<li><p>
3.1 变量可变
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #81A1C1;">const</span> <span style="color: #D8DEE9;">MUM</span>:<span style="color: #8FBCBB;">u32</span> = 100;
<span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">main</span>() {

    <span style="color: #81A1C1;">let</span> <span style="color: #81A1C1;">mut</span> <span style="color: #D8DEE9;">x</span> = 5;
    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"this value = &gt; </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,x);
    x = 6;
    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"this value now = &gt; </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;"> </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,x ,<span style="color: #8FBCBB;">MUM</span>); <span style="color: #6f7787;">// </span><span style="color: #6f7787;">6.100</span>
    <span style="color: #6f7787;">//</span><span style="color: #6f7787;">shadowing</span>
    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">y</span> = 2;
    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">y</span> = y+1;
    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">y</span> = y*2;

    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"y =&gt; </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>, y); <span style="color: #6f7787;">// </span><span style="color: #6f7787;">y==6</span>
    <span style="color: #6f7787;">// </span><span style="color: #6f7787;">let &#24050;&#32463;&#30456;&#24403;&#20110;&#37325;&#26032;&#23450;&#20041;&#20102;</span>
    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">speace</span> = <span style="color: #A3BE8C;">"    "</span>;
    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">speace</span> = speace.len();
        <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">" ... </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,speace);

}
</pre>
</div></li>

<li><p>
3.2 数据类型
</p>
<div class="org-src-container">
<pre class="src src-rust">  <span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">main</span>() {
   <span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#20803;&#32452;</span>
   <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">xs</span>:(<span style="color: #8FBCBB;">i32</span>,<span style="color: #8FBCBB;">f64</span>,<span style="color: #8FBCBB;">u8</span>)=(100,5.3,1);

   <span style="color: #81A1C1;">let</span>(x,y,z)=xs;
   <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"x == </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">,y == </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">,z == </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,x,y,z );
   <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"x == </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">,y == </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">,z == </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,xs.0,xs.1,xs.2);


   <span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#25968;&#32452;</span>
   <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">a</span>:[<span style="color: #8FBCBB;">i32</span>;3]=[1,2,3];
   <span style="color: #81A1C1;">for</span> i <span style="color: #81A1C1;">in</span> 0..3 {
       <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"a == &gt; </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,a[i] );
   }
}
</pre>
</div></li>

<li><p>
3.3 函数工作
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">main</span>() {
    anot(1,3);
    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"returnx - &gt;</span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;"> "</span>,anots(1,2));
}

<span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">anot</span>(<span style="color: #D8DEE9;">x</span>:<span style="color: #8FBCBB;">i32</span>,<span style="color: #D8DEE9;">y</span>:<span style="color: #8FBCBB;">i32</span>){
    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"x value ==&gt; </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;"> \ny value ==&gt; </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>, x,y);
}
<span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">anots</span>(<span style="color: #D8DEE9;">x</span>:<span style="color: #8FBCBB;">i32</span>,<span style="color: #D8DEE9;">y</span>:<span style="color: #8FBCBB;">i32</span>)-&gt;<span style="color: #8FBCBB;">i32</span>{
    <span style="color: #81A1C1;">return</span> x+y;
}

</pre>
</div>
<div class="org-src-container">
<pre class="src src-rust">   <span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">main</span>() {
    <span style="color: #81A1C1;">let</span> x=5;
    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">y</span> ={
        <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">x</span> =3;
        x+1 <span style="color: #6f7787;">// </span><span style="color: #6f7787;">&#34920;&#36798;&#24335;&#32467;&#23614;&#27809;&#26377;&#20998;&#21495;,&#21152;&#20998;&#21495;&#23601;&#26159;&#35821;&#21477;,&#35821;&#21477;&#27809;&#26377;&#36820;&#22238;&#20540;</span>
    };

    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"x===&gt; </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">,y===&gt;</span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,x,y ); <span style="color: #6f7787;">//</span><span style="color: #6f7787;">5 , 4</span>

    <span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#35821;&#21477;&#27809;&#26377;&#36820;&#22238;&#20540;, &#34920;&#36798;&#24335;&#26377; &#27604;&#22914;:</span>
    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">d</span> = hello(2);
    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"d == &gt; </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,d );

}

<span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">hello</span>(<span style="color: #D8DEE9;">x</span>:<span style="color: #8FBCBB;">i32</span>)-&gt;<span style="color: #8FBCBB;">i32</span>{
    x*x
}

</pre>
</div></li>

<li><p>
3.5 控制流
</p>
<div class="org-src-container">
<pre class="src src-rust">
<span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">main</span>() {

    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">x</span> = <span style="color: #81A1C1;">true</span>;

    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">b</span> = <span style="color: #81A1C1;">if</span> x{
        4
    }<span style="color: #81A1C1;">else</span>{
        3
    };
    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"b --&gt; </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>, b);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust">
<span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">main</span>() {

    <span style="color: #6f7787;">//</span><span style="color: #6f7787;">rev&#26159;&#21453;&#36716;</span>
    <span style="color: #81A1C1;">for</span> num <span style="color: #81A1C1;">in</span> (1..4).rev() {
        <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"num -&gt;  </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">!"</span>,num);
    }
    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"OVER"</span>);
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">num -&gt;  3!</span>
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">num -&gt;  2!</span>
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">num -&gt;  1!</span>
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">OVER</span>
}
</pre>
</div></li>

<li><p>
作用域
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">main</span>() {
    <span style="color: #6f7787;">//</span><span style="color: #6f7787;">rust &#20316;&#29992;&#22495;</span>
    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">s</span> = <span style="color: #A3BE8C;">"hello"</span>;
    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"</span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,s);
}
<span style="color: #6f7787;">// </span><span style="color: #6f7787;">&#22312;&#19968;&#20010;&#20989;&#25968;&#32467;&#23614; s &#30340;&#20316;&#29992;&#22495;&#24050;&#32463;&#32467;&#26463;</span>
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">s&#24050;&#32463;&#26080;&#25928;&#20102;</span>
<span style="color: #81A1C1;">fn</span> <span style="color: #8FBCBB;">main</span>() {
    <span style="color: #6f7787;">//</span><span style="color: #6f7787;">rust &#20316;&#29992;&#22495;</span>
    <span style="color: #81A1C1;">let</span> <span style="color: #81A1C1;">mut</span> <span style="color: #D8DEE9;">s</span> = <span style="color: #8FBCBB;">String</span>::from(<span style="color: #A3BE8C;">"test"</span>);
    s.push_str(<span style="color: #A3BE8C;">"string"</span>);
    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"s -&gt; </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,s);
    <span style="color: #81A1C1;">let</span> <span style="color: #D8DEE9;">s2</span> = s;
    <span style="color: #81A1C1;">println!</span>(<span style="color: #A3BE8C;">"s2 -&gt; </span><span style="color: #A3BE8C; font-style: italic;">{}</span><span style="color: #A3BE8C;">"</span>,s2);
}

<span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#31532;&#19968;&#20010; , &#25226;5&#32465;&#23450;&#21040;x &#25509;&#30528;&#20540;&#25335;&#36125; &#32465;&#23450;&#21040; y</span>
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">&#31532;&#20108;&#20010; string &#24213;&#23618;&#26159; data cap len  data &#26159;&#19968;&#20010;&#25351;&#38024;,</span>
<span style="color: #6f7787;">// </span><span style="color: #6f7787;">&#25152;&#20197;&#31532;&#20108;&#20010; s2 &#21644; s1 &#25351;&#21521;&#21516;&#19968;&#20010;&#22320;&#22336;</span>
<span style="color: #6f7787;">// </span><span style="color: #6f7787;">&#24403;&#28982;&#21487;&#20197;&#21482;&#29992;  s1.clone() &#36827;&#34892;&#22534;&#25335;&#36125;</span>
</pre>
</div></li>
</ul>
</div>
</div>
